package service;

import model.Event;

import java.util.Set;

public class RussianFilter {
    private static final Set<String> RUSSIAN_TEAMS = Set.of(
            "Зенит",
            "Спартак",
            "ЦСКА",
            "Локомотив",
            "Динамо",
            "Краснодар",
            "Ростов",
            "Рубин",
            "Ахмат",
            "Факел",
            "Крылья Советов",
            "Балтика",
            "Ротор",
            "Урал",
            "Пари Нижний Новгород",
            "Торпедо",
            "Сочи",
            "Оренбург",
            "Амкал",
            "ФК Эгриси",
            "2DROTS",
            "Broke Boys",
            "Lit Energy",
            "Fight Nights",
            "PRIME SQUAD",
            "ФК Банка",
            "Синдекат",
            "ФК 10",
            "Россия",

            // Хоккей
            "СКА",
            "Ак Барс",
            "Автомобилист",
            "Авангард",
            "Металлург Мг",
            "Торпедо НН",
            "Трактор",
            "Салават Юлаев",
            "Локомотив Я",
            "Динамо Минск",
            "ЦСКА Москва",
            "Северсталь",

            // Баскетбол
            "УНИКС",
            "Локомотив-Кубань",
            "Челбаскет",
            "Динамо Владивосток",
            "Темп-СУМЗ",
            "Динамо Грозный",
            "Динамо Уфа",
            "БК Химки",
            "ЦСКА-2",
            "Зенит-2",

            // Теннис
            "Медведев Даниил",
            "Рублёв Андрей",
            "Андреева Мирра",
            "Калинская Анна",
            "Козырева Мария",
            "Корнеева Алина",
            "Рахимова Камилла",
            "Селехметьева Оксана",
            "Касаткина Дарья",
            "Блинкова Анна",
            "Кудерметова Вероника",
            "Захарова Анастасия",
            "Самсонова Людмила",
            "Александрова Екатерина",
            "Шнайдер Диана",
            "Хачанов Карен",
            "Сифиуллин Роман",
            "Карацев Аслан",
            "Ватутин Алексей"
    );

    public static boolean isRussian(Event e) {

        return containsRussian(e.getTeam1())
                || containsRussian(e.getTeam2());
    }

    private static boolean containsRussian(String text) {

        if (text == null) return false;

        return RUSSIAN_TEAMS.stream()
                .anyMatch(team ->
                        text.toLowerCase()
                                .contains(team.toLowerCase()));
    }
}
